import './App.css';
import React from 'react';

export default class Author extends React.Component
{
render(){
  return(
    <div className="Author">
      <h1>Уильям Шекспир</h1>
      <p>Родился 23 апреля (дата примерная) 1564 года в городе Стратфорд-апон-Эйвон, Англия. Отец — Джон Шекспир (1530—1601), 
        ремесленник. Мать — Мэри Арден (1537—1608). В 1582 году женился на Энн Хатауэй, от которой имел трёх детей. Вскоре они 
        переехали в Лондон, где Шекспир стал актёром в труппе «Слуги лорда-камергера». С 1594 года стал совладельцем труппы, после чего 
        они стали ставить его пьесы. В 1599 году они построили театр под названием «Глобус». В 1613 году вернулся в родной город. 
        Умер 23 апреля 1616 года в возрасте 52 лет. Похоронен в церкви Святой Троицы в Стратфорд-апон-Эйвон. Основные произведения: 
        «Ромео и Джульетта», «Гамлет», «Король Лир», «Отелло», «Макбет», «Сон в летнюю ночь» и другие.</p>
    </div>
  )
}
}
