import './App.css';
import React from 'react';

export default class Hamlet extends React.Component{
    render(){
      return(
        <div className="Hamlet">
          <h2>
          Траги́ческая исто́рия о Га́млете, при́нце да́тском
          </h2>
          <p>Трагедия Уильяма Шекспира «Гамлет» была написана в 1600 – 1601 годах и является одним из наиболее известных 
            произведений мировой литературы. Сюжет трагедии основан на легенде о правителе Дании, посвященной истории 
            мести главного героя за смерть своего отца. В «Гамлете» Шекспир поднимает ряд важных тем, касающихся вопросов нравственности, 
            чести и долга героев. Особое внимание автор уделяет философской теме жизни и смерти.</p>
        </div>
      )
    }
  }